ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_tli.h
/* TLI_CTL */
#define TLI_CTL_TLIEN                     BIT(0)                            /*!< TLI enable bit */
#define TLI_CTL_BDB                       BITS(4,6)                         /*!< blue channel dither bits number */
#define TLI_CTL_GDB                       BITS(8,10)                        /*!< green channel dither bits number */
#define TLI_CTL_RDB                       BITS(12,14)                       /*!< red channel dither bits number */
#define TLI_CTL_DFEN                      BIT(16)                           /*!< dither function enable */
#define TLI_CTL_CLKPS                     BIT(28)                           /*!< pixel clock polarity selection */
#define TLI_CTL_DEPS                      BIT(29)                           /*!< data enable polarity selection */
#define TLI_CTL_VPPS                      BIT(30)                           /*!< vertical pulse polarity selection */
#define TLI_CTL_HPPS                      BIT(31)                           /*!< horizontal pulse polarity selection */

/* TLI_RL */
#define TLI_RL_RQR                        BIT(0)                            /*!< request reload */
#define TLI_RL_FBR                        BIT(1)                            /*!< frame blank reload */

/* TLI_BGC */
#define TLI_BGC_BVB                       BITS(0,7)                         /*!< background value blue */
#define TLI_BGC_BVG                       BITS(8,15)                        /*!< background value green */
#define TLI_BGC_BVR                       BITS(16,23)                       /*!< background value red */

/* TLI_INTEN */
#define TLI_INTEN_LMIE                    BIT(0)                            /*!< line mark interrupt enable */
#define TLI_INTEN_FEIE                    BIT(1)                            /*!< FIFO error interrupt enable */
#define TLI_INTEN_TEIE                    BIT(2)                            /*!< transaction error interrupt enable */
#define TLI_INTEN_LCRIE                   BIT(3)                            /*!< layer configuration reloaded interrupt enable */

/* TLI_INTF */
#define TLI_INTF_LMF                      BIT(0)                            /*!< line mark flag */
#define TLI_INTF_FEF                      BIT(1)                            /*!< FIFO error flag */
#define TLI_INTF_TEF                      BIT(2)                            /*!< transaction error flag */
#define TLI_INTF_LCRF                     BIT(3)                            /*!< layer configuration reloaded flag */

/* TLI_INTC */
#define TLI_INTC_LMC                      BIT(0)                            /*!< line mark flag clear */
#define TLI_INTC_FEC                      BIT(1)                            /*!< FIFO error flag clear */
#define TLI_INTC_TEC                      BIT(2)                            /*!< transaction error flag clear */
#define TLI_INTC_LCRC                     BIT(3)                            /*!< layer configuration reloaded flag clear */

/* TLI_LM */
#define TLI_LM_LM                         BITS(0,10)                        /*!< line mark value */

/* TLI_CPPOS */
#define TLI_CPPOS_VPOS                    BITS(0,15)                        /*!< vertical position */
#define TLI_CPPOS_HPOS                    BITS(16,31)                       /*!< horizontal position */

/* TLI_STAT */
#define TLI_STAT_VDE                      BIT(0)                            /*!< current VDE status */
#define TLI_STAT_HDE                      BIT(1)                            /*!< current HDE status */
#define TLI_STAT_VS                       BIT(2)                            /*!< current VS status of the TLI */
#define TLI_STAT_HS                       BIT(3)                            /*!< current HS status of the TLI  */

/* TLI_LXCTL */
#define TLI_LXCTL_LEN                     BIT(0)                            /*!< layer enable */
#define TLI_LXCTL_CKEYEN                  BIT(1)                            /*!< color keying enable */
#define TLI_LXCTL_LUTEN                   BIT(4)                            /*!< LUT enable */

/* TLI_LXHPOS */
#define TLI_LXHPOS_WLP                    BITS(0,11)                        /*!< window left position */
#define TLI_LXHPOS_WRP                    BITS(16,27)                       /*!< window right position */

/* TLI_LXVPOS */
#define TLI_LXVPOS_WTP                    BITS(0,11)                        /*!< window top position */
#define TLI_LXVPOS_WBP                    BITS(16,27)                       /*!< window bottom position */

/* TLI_LXCKEY */
#define TLI_LXCKEY_CKEYB                  BITS(0,7)                         /*!< color key blue */
#define TLI_LXCKEY_CKEYG                  BITS(8,15)                        /*!< color key green */
#define TLI_LXCKEY_CKEYR                  BITS(16,23)                       /*!< color key red */

/* TLI_LXPPF */
#define TLI_LXPPF_PPF                     BITS(0,2)                         /*!< packed pixel format */

/* TLI_LXSA */
#define TLI_LXSA_SA                       BITS(0,7)                         /*!< specified alpha */

/* TLI_LXDC */
#define TLI_LXDC_DCB                      BITS(0,7)                         /*!< the default color blue */
#define TLI_LXDC_DCG                      BITS(8,15)                        /*!< the default color green */
#define TLI_LXDC_DCR                      BITS(16,23)                       /*!< the default color red */
#define TLI_LXDC_DCA                      BITS(24,31)                       /*!< the default color alpha */

/* TLI_LXBLEND */
#define TLI_LXBLEND_ACF2                  BITS(0,2)                         /*!< alpha calculation factor 2 of blending method */
#define TLI_LXBLEND_ACF1                  BITS(8,10)                        /*!< alpha calculation factor 1 of blending method */

/* TLI_LXFBADDR */
#define TLI_LXFBADDR_FBADD                BITS(0,31)                        /*!< frame buffer base address */

/* TLI_LXFLLEN */
#define TLI_LXFLLEN_FLL                   BITS(0,13)                        /*!< frame line length */
#define TLI_LXFLLEN_STDOFF                BITS(16,29)                       /*!< frame buffer stride offset */

/* TLI_LXFTLN */
#define TLI_LXFTLN_FTLN                   BITS(0,10)                        /*!< frame total line number */

/* TLI_LXLUT */
#define TLI_LXLUT_TB                      BITS(0,7)                         /*!< blue channel of a LUT entry */
#define TLI_LXLUT_TG                      BITS(8,15)                        /*!< green channel of a LUT entry */
#define TLI_LXLUT_TR                      BITS(16,23)                       /*!< red channel of a LUT entry */
#define TLI_LXLUT_TADD                    BITS(24,31)                       /*!< look up table write address */

/* constants definitions */
/* TLI parameter struct definitions */
typedef struct
{   
    uint16_t synpsz_vpsz;                                                   /*!< size of the vertical synchronous pulse */
    uint16_t synpsz_hpsz;                                                   /*!< size of the horizontal synchronous pulse */
    uint16_t backpsz_vbpsz;                                                 /*!< size of the vertical back porch plus synchronous pulse */
    uint16_t backpsz_hbpsz;                                                 /*!< size of the horizontal back porch plus synchronous pulse */
    uint32_t activesz_vasz;                                                 /*!< size of the vertical active area width plus back porch and synchronous pulse */
    uint32_t activesz_hasz;                                                 /*!< size of the horizontal active area width plus back porch and synchronous pulse */
    uint32_t totalsz_vtsz;                                                  /*!< vertical total size of the display */
    uint32_t totalsz_htsz;                                                  /*!< horizontal total size of the display */
    uint32_t backcolor_red;                                                 /*!< background value red */
    uint32_t backcolor_green;                                               /*!< background value green */
    uint32_t backcolor_blue;                                                /*!< background value blue */
    uint32_t signalpolarity_hs;                                             /*!< horizontal pulse polarity selection */
    uint32_t signalpolarity_vs;                                             /*!< vertical pulse polarity selection */
    uint32_t signalpolarity_de;                                             /*!< data enable polarity selection */
    uint32_t signalpolarity_pixelck;                                        /*!< pixel clock polarity selection */
}tli_parameter_struct; 

/* TLI layer parameter struct definitions */
typedef struct
{
    uint16_t layer_window_rightpos;                                         /*!< window right position */
    uint16_t layer_window_leftpos;                                          /*!< window left position */
    uint16_t layer_window_bottompos;                                        /*!< window bottom position */
    uint16_t layer_window_toppos;                                           /*!< window top position */
    uint32_t layer_ppf;                                                     /*!< packeted pixel format */
    uint8_t  layer_sa;                                                      /*!< specified alpha */
    uint8_t  layer_default_alpha;                                           /*!< the default color alpha */
    uint8_t  layer_default_red;                                             /*!< the default color red */
    uint8_t  layer_default_green;                                           /*!< the default color green */
    uint8_t  layer_default_blue;                                            /*!< the default color blue */
    uint32_t layer_acf1;                                                    /*!< alpha calculation factor 1 of blending method */
    uint32_t layer_acf2;                                                    /*!< alpha calculation factor 2 of blending method */
    uint32_t layer_frame_bufaddr;                                           /*!< frame buffer base address */
    uint16_t layer_frame_buf_stride_offset;                                 /*!< frame buffer stride offset */
    uint16_t layer_frame_line_length;                                       /*!< frame line length */
    uint16_t layer_frame_total_line_number;                                 /*!< frame total line number */
}tli_layer_parameter_struct; 

/* TLI layer LUT parameter struct definitions */
typedef struct
{
    uint32_t layer_table_addr;                                              /*!< look up table write address */
    uint8_t layer_lut_channel_red;                                          /*!< red channel of a LUT entry */
    uint8_t layer_lut_channel_green;                                        /*!< green channel of a LUT entry */
    uint8_t layer_lut_channel_blue;                                         /*!< blue channel of a LUT entry */
}tli_layer_lut_parameter_struct; 

/* packeted pixel format */
typedef enum 
{
     LAYER_PPF_ARGB8888 = 0U,                                               /*!< layerx pixel format ARGB8888 */
     LAYER_PPF_RGB888,                                                      /*!< layerx pixel format RGB888 */
     LAYER_PPF_RGB565,                                                      /*!< layerx pixel format RGB565 */
     LAYER_PPF_ARGB1555,                                                    /*!< layerx pixel format ARGB1555 */
     LAYER_PPF_ARGB4444,                                                    /*!< layerx pixel format ARGB4444 */
     LAYER_PPF_L8,                                                          /*!< layerx pixel format L8 */
     LAYER_PPF_AL44,                                                        /*!< layerx pixel format AL44 */
     LAYER_PPF_AL88                                                         /*!< layerx pixel format AL88 */
}tli_layer_ppf_enum;

